app/Controllers/Client/AccueilController.php

    public function index()
    {
        if ($r = $this->verificationConnexion()) {
            return $r;
        }

        $user = $this->userModel->find(session()->get('user_id'));
---
SELECT *
FROM `user`
WHERE `user`.`id` = 6