app/Controllers/Client/OperationController.php

SELECT *
FROM `type`
WHERE `nom` = 'depot'
 LIMIT 1
---
    public function createOperation()
    {
        if ($r = $this->verificationConnexion()) {
            return $r;
        }

        $typeOperation = strtolower(trim((string) $this->request->getPost('type_operation')));
        $montant = (float) $this->request->getPost('montant');
        $numeroDestination = trim((string) $this->request->getPost('numero_user_destination'));
        $numeroDestination = str_replace(' ', '', $numeroDestination);

        if (!in_array($typeOperation, ['depot', 'retrait', 'transfert'], true)) {
            return redirect()->back()
                ->withInput()
                ->with('error', "Type d'opération invalide.");
        }

        if ($montant <= 0) {
            return redirect()->back()
                ->withInput()
                ->with('error', 'Le montant doit être supérieur à zéro.');
        }

        $type = $this->typeModel->where('nom', $typeOperation)->first();

SELECT *
FROM `user`
WHERE `user`.`id` = 6
---
        }

        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);

SELECT *
FROM `user`
WHERE `user`.`id` = 6
UPDATE `user` SET `solde` = 100000
WHERE `user`.`id` IN (6)
INSERT INTO `operation` (`id_type`, `id_user_source`, `id_user_destination`, `montant`, `frais`, `date_creation`) VALUES (1, NULL, 6, 100000, 0, '2026-07-20 09:59:26')
---
        }

        if ($idUserDestination !== null) {
            $destinataireActuel = $this->userModel->find($idUserDestination);
            $this->userModel->update($idUserDestination, [
                'solde' => $destinataireActuel['solde'] + $montant,
            ]);
        }

        $this->operationModel->insert([
            'id_type'              => $type['id'],
            'id_user_source'       => $idUserSource,
            'id_user_destination'  => $idUserDestination,
            'montant'              => $montant,
            'frais'                => $frais,
            'date_creation'        => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `user`
WHERE `user`.`id` = 6
---
                ->with('error', "Une erreur est survenue lors de l'opération. Merci de réessayer.");
        }

        $userMisAJour = $this->userModel->find($userId);

SELECT `operation`.*, `type`.`nom` as `type_nom`, `src`.`numero_telephone` as `source_numero`, `dst`.`numero_telephone` as `destination_numero`
FROM `operation`
JOIN `type` ON `operation`.`id_type` = `type`.`id`
LEFT JOIN `user` as `src` ON `operation`.`id_user_source` = `src`.`id`
LEFT JOIN `user` as `dst` ON `operation`.`id_user_destination` = `dst`.`id`
WHERE `id_user_source` = 6
OR `id_user_destination` = 6
ORDER BY `date_creation` DESC
---
    public function historiques()
    {
        if ($r = $this->verificationConnexion()) {
            return $r;
        }

        $userId = session()->get('user_id');

        $operations = $this->operationModel
            ->select('operation.*, type.nom as type_nom, src.numero_telephone as source_numero, dst.numero_telephone as destination_numero')
            ->join('type', 'operation.id_type = type.id')
            ->join('user as src', 'operation.id_user_source = src.id', 'left')
            ->join('user as dst', 'operation.id_user_destination = dst.id', 'left')
            ->where('id_user_source', $userId)
            ->orWhere('id_user_destination', $userId)
            ->orderBy('date_creation', 'DESC')
            ->findAll();