app/Controllers/Auth/LoginController.php

    public function verify()
    {
        $numero = $this->request->getPost('numero_telephone');
        $numero = trim($numero);
        $numero = str_replace(' ', '', $numero);

        $verification = $this->verifyNumeroTelephone($numero);

        if ($verification !== true) {
            return redirect()->back()
                ->withInput()
                ->with('error', $verification);
        }

        try {
            $user = $this->userModel
                ->where('numero_telephone', $numero)
                ->first();

            if (!$user) {

                $data = [
                    'numero_telephone' => $numero,
                    'solde'            => 0
                ];

                $this->userModel->insert($data);

                $user = $this->userModel
                    ->where('numero_telephone', $numero)
                    ->first();
---
SELECT *
FROM `user`
WHERE `numero_telephone` = '388335086'
 LIMIT 1
INSERT INTO `user` (`numero_telephone`, `solde`) VALUES ('388335086', 0)