app/Controllers/Admin/BaremeFraisController.php

    public function index()
    {
        $types = $this->typeModel->findAll();

        $baremes = $this->baremeFraisModel
            ->select('bareme_frais.*, type.nom as type_nom')
            ->join('type', 'type.id = bareme_frais.id_type')
            ->orderBy('type.nom', 'ASC')
            ->orderBy('bareme_frais.montant_min', 'ASC')
            ->findAll();
---
SELECT *
FROM `type`
SELECT `bareme_frais`.*, `type`.`nom` as `type_nom`
FROM `bareme_frais`
JOIN `type` ON `type`.`id` = `bareme_frais`.`id_type`
ORDER BY `type`.`nom` ASC, `bareme_frais`.`montant_min` ASC