app/Controllers/LoginController.php

    public function verify()
    {
        $numero = trim($this->request->getPost('numero_telephone'));

        if (!preg_match('/^(32|33|34|37|38)\d{7}$/', $numero)) {
            return redirect()->back()
                ->withInput()
                ->with('error', 'Numéro de téléphone invalide.');
        }

        try {
            $user = $this->userModel
                ->where('numero_telephone', $numero)
                ->first();

            if (!$user) {

                $data = [
                    'numero_telephone' => $numero,
                    'solde'            => 0,
                    'role'             => 'client'
                ];

                $this->userModel->insert($data);

                $user = $this->userModel
                    ->where('numero_telephone', $numero)
                    ->first();
---
SELECT *
FROM `user`
WHERE `numero_telephone` = '388335085'
 LIMIT 1
SELECT *
FROM `user`
WHERE `numero_telephone` = '327141250'
 LIMIT 1